[
  "Did you know? The first speeding ticket was issued in 1896 for going 12 mph.",
  "Did you know? The average car has over 30,000 parts.",
  "Did you know? The first gasoline-powered car was built in 1885 by Karl Benz.",
  "Did you know? Modern cars have over 100 million lines of code.",
  "Did you know? Tesla's Model S Plaid goes 0–60 mph in under 2 seconds.",
  "Did you know? Windscreen wipers were invented by a woman named Mary Anderson in 1903.",
  "Did you know? Volvo gave away the patent for the 3-point seatbelt to save lives.",
  "Did you know? The average driver spends about 4.3 years of their life behind the wheel.",
  "Did you know? The Bugatti Veyron needs 10 radiators to stay cool.",
  "Did you know? Electric cars were more popular than gasoline cars in the early 1900s.",
  "Did you know? The Ford Model T was the first mass-produced car.",
  "Did you know? The world’s longest car was over 100 feet long and had a helipad.",
  "Did you know? Some F1 cars can go from 0–100–0 km/h in under 5 seconds.",
  "Did you know? The average car tire rotates 400 million times over its lifespan.",
  "Did you know? Diesel engines are more fuel-efficient than gasoline ones.",
  "Did you know? Cars are recycled more than any other product in the world.",
  "Did you know? The Toyota Corolla is the best-selling car of all time.",
  "Did you know? The Rolls-Royce hood ornament is retractable to prevent theft.",
  "Did you know? The first car radio was introduced in 1930.",
  "Did you know? NASCAR cars don’t have headlights—they use stickers!",
  "Did you know? Some cars today have over 70 computers on board.",
  "Did you know? Hybrid cars can charge their batteries by braking (regenerative braking).",
  "Did you know? Cruise control was invented by a blind engineer, Ralph Teetor.",
  "Did you know? Lamborghini started as a tractor company.",
  "Did you know? A dirty air filter can reduce your fuel efficiency by 10%.",
  "Did you know? The average lifespan of a modern car is about 12 years or 200,000 km.",
  "Did you know? The first car accident happened in 1891.",
  "Did you know? In Tokyo, there's a building with a highway passing through it!",
  "Did you know? In Finland, speeding tickets are based on your income.",
  "Did you know? The Hennessey Venom F5 aims to break 300 mph speed records.",
  "Did you know? The average vehicle has 6–10 airbags today.",
  "Did you know? The world’s first electric traffic light was installed in 1914 in Cleveland.",
  "Did you know? Ferrari makes only 14 cars a day.",
  "Did you know? Mercedes-Benz was the first to introduce ABS in 1978.",
  "Did you know? Some car engines are so powerful they’re banned in certain countries.",
  "Did you know? EVs require far fewer moving parts than combustion engine cars.",
  "Did you know? Horsepower was invented as a marketing term by James Watt.",
  "Did you know? You can legally drive on the left or right depending on the country—over 70 drive on the left!",
  "Did you know? Rear-view mirrors were first used in car racing before being standard in cars.",
  "Did you know? There's a car made almost entirely out of LEGO that can drive.",
  "Did you know? Rolls-Royce engines are so quiet that testers use ticking clocks to detect noise.",
  "Did you know? The average car is parked 95% of its life.",
  "Did you know? Car airbags deploy in 30 milliseconds.",
  "Did you know? Racing stripes were first used to help identify cars from aerial views.",
  "Did you know? Toyota has made more cars than the entire population of Germany.",
  "Did you know? Self-driving cars are already delivering groceries in some cities.",
  "Did you know? Some luxury cars now come with massage seats and scent diffusers.",
  "Did you know? The Chevrolet Suburban is the longest-running car nameplate still in production.",
  "Did you know? Jay Leno owns over 180 cars in his private collection.",
  "Did you know? Some cars have built-in Wi-Fi and 5G.",
  "Did you know? The average modern key fob can control windows, doors, and even start the engine remotely.",
  "Did you know? Many cars can now park themselves.",
  "Did you know? Most Formula 1 teams spend over $300 million a year on racing.",
  "Did you know? There's a record for the tightest parallel park — just 7.5 cm of clearance!",
  "Did you know? Bugatti brake calipers are 3D-printed titanium.",
  "Did you know? You can buy a car vending machine in Singapore.",
  "Did you know? LED headlights consume less power and last longer than halogens.",
  "Did you know? Cold weather can reduce EV range by up to 40%.",
  "Did you know? EVs make synthetic sounds to warn pedestrians since they’re silent.",
  "Did you know? Some concept cars have no steering wheels or pedals.",
  "Did you know? There are cars with solar panels integrated into their roofs.",
  "Did you know? Some tires can seal themselves after a puncture!",
  "Did you know? The BMW logo represents a spinning propeller — a nod to its aircraft roots.",
  "Did you know? Most vehicles use over 20 different kinds of plastic.",
  "Did you know? The Jeep grille design has 7 slots — one for each continent.",
  "Did you know? Paint color can affect resale value — white and silver hold value better.",
  "Did you know? Hybrid cars can use both gas and electric power simultaneously or separately.",
  "Did you know? The first cars didn’t have steering wheels — they had levers!",
  "Did you know? Rearview cameras have been mandatory in new cars in many countries since 2018.",
  "Did you know? Formula 1 pit crews can change four tires in under 2 seconds.",
  "Did you know? Some modern cars can update themselves over the internet (OTA updates).",
  "Did you know? In the 1900s, cars were often compared to horses in ads.",
  "Did you know? Some luxury cars can read road signs and adjust your speed accordingly.",
  "Did you know? Your car's ECU can process millions of decisions per second.",
  "Did you know? The first hybrid car was built in 1900 by Ferdinand Porsche.",
  "Did you know? Some new cars don't have physical buttons — only touchscreens!",
  "Did you know? Tire pressure can change with temperature, affecting fuel economy.",
  "Did you know? EVs are usually faster from 0–60 mph due to instant torque.",
  "Did you know? The average car has traveled the equivalent of 5 times around Earth in its lifetime.",
  "Did you know? In Sweden, Saab tested cars by launching them off cliffs to test safety.",
  "Did you know? The Porsche 911 has kept its basic design since 1964.",
  "Did you know? In Japan, car owners must prove they have parking before they can buy a car.",
  "Did you know? Some concept tires are airless and puncture-proof.",
  "Did you know? Cars can communicate with traffic lights in smart cities using V2X.",
  "Did you know? The average American spends 18 days a year inside their car.",
  "Did you know? Racing cars use steering wheels packed with over 20 buttons!",
  "Did you know? Some modern cars can change lanes automatically on highways.",
  "Did you know? Electric cars cost less to maintain — no oil changes or spark plugs!",
  "Did you know? Bugatti uses diamonds in speedometers in some models.",
  "Did you know? Some Lamborghinis have scissor doors because... drama.",
  "Did you know? Engine oil doesn’t just lubricate — it also cools and cleans.",
  "Did you know? BMW once made electric cars back in 1972 for the Olympics!",
  "Did you know? Toyota once made sewing machines before cars.",
  "Did you know? The term 'car' comes from the Latin word 'carrus' meaning a two-wheeled cart.",
  "Did you know? There’s a Guinness record for the most people crammed in a Smart car — 20!"
]
